haliboteda/open_plc_arduino/boards.txt
menu.pnum=Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.virtio=Virtual serial support

menu.opt=Optimize
menu.dbg=Debug symbols and core logs
menu.rtlib=C Runtime Library
menu.upload_method=Upload method
menu.knxrole=KNX Role

################################################################################
# OPEN-pLC H7
OPEN-PLC.name=OPEN-PLC

OPEN-PLC.build.core=arduino
OPEN-PLC.build.board= GenH7
OPEN-PLC.build.st_extra_flags=-DCORE_CM7 -D{build.product_line} {build.enable_usb} {build.xSerial} {build.knx_flags}
# Default KNX role: KNXnet/IP device.  Overridden by menu.knxrole selection.
OPEN-PLC.build.knx_flags=-DMASK_VERSION=0x5780
OPEN-PLC.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
OPEN-PLC.build.fpu=-mfpu=fpv4-sp-d16
OPEN-PLC.build.float-abi=-mfloat-abi=hard
OPEN-PLC.build.series=STM32H7xx
OPEN-PLC.build.mcu=cortex-m7
OPEN-PLC.upload.maximum_size=0
OPEN-PLC.upload.maximum_data_size=0

# PLC H743IIKx
OPEN-PLC.menu.pnum.PLC_H743=PLC H743
OPEN-PLC.menu.pnum.PLC_H743.upload.maximum_size=2097152
OPEN-PLC.menu.pnum.PLC_H743.upload.maximum_data_size=524288
OPEN-PLC.menu.pnum.PLC_H743.build.board=PLC_H743
OPEN-PLC.menu.pnum.PLC_H743.build.product_line=STM32H743xx
OPEN-PLC.menu.pnum.PLC_H743.build.variant_h=variant_{build.board}.h
OPEN-PLC.menu.pnum.PLC_H743.build.variant=STM32H7xx/H743
OPEN-PLC.menu.pnum.PLC_H743.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
OPEN-PLC.menu.pnum.PLC_H743.build.ldscript=ldscript.ld
OPEN-PLC.menu.pnum.PLC_H743.build.extra_flags=-DLAN8742A_PHY_ADDRESS=0 -DETH_RXBUFNB=4 -DETH_TXBUFNB=4 -DETH_RX_BUF_SIZE=1536 -DETH_TX_BUF_SIZE=1536 -DOPENPLC_UDP_SERVER_AUTOSTART -DD_CACHE_DISABLED
#-DMAC_ADDR0=0x00 -DMAC_ADDR1=0x80 -DMAC_ADDR2=0xE1 -DMAC_ADDR3=0x00 -DMAC_ADDR4=0x43 -DMAC_ADDR5=0x21 

# KNX role - sets MASK_VERSION for the OpenPLC_KNX library.
# Default (no selection needed): 0x5780 IP+TP dual device, set above in build.knx_flags.
# Override here only for single-transport or coupler roles.
OPEN-PLC.menu.knxrole.dual_device=IP+TP Device (both transports, MASK 0x5780) [DEFAULT]
OPEN-PLC.menu.knxrole.dual_device.build.knx_flags=-DMASK_VERSION=0x5780

OPEN-PLC.menu.knxrole.ip_device=KNXnet/IP Device (IP only, MASK 0x57B0)
OPEN-PLC.menu.knxrole.ip_device.build.knx_flags=-DMASK_VERSION=0x57B0

OPEN-PLC.menu.knxrole.tp_device=KNX TP Device (TP bus only, MASK 0x07B0)
OPEN-PLC.menu.knxrole.tp_device.build.knx_flags=-DMASK_VERSION=0x07B0

OPEN-PLC.menu.knxrole.coupler=KNX IP/TP Coupler (routes between nets, MASK 0x091A)
OPEN-PLC.menu.knxrole.coupler.build.knx_flags=-DMASK_VERSION=0x091A

# USB connectivity
# OPEN-PLC.menu.usb.none=None
OPEN-PLC.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
OPEN-PLC.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
OPEN-PLC.menu.usb.CDC=CDC (no generic 'Serial')
OPEN-PLC.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
OPEN-PLC.menu.xusb.FS=Low/Full Speed
OPEN-PLC.menu.xusb.HS=High Speed
OPEN-PLC.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
OPEN-PLC.menu.xusb.HSFS=High Speed in Full Speed mode
OPEN-PLC.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS


# Upload menu

OPEN-PLC.menu.upload_method.cdcMethod=CDC Transfer
OPEN-PLC.menu.upload_method.cdcMethod.upload.protocol=
OPEN-PLC.menu.upload_method.cdcMethod.upload.options=
OPEN-PLC.menu.upload_method.cdcMethod.upload.tool=cdctransfer

OPEN-PLC.menu.upload_method.ethMethod=ETH Transfer
OPEN-PLC.menu.upload_method.ethMethod.upload.protocol=
OPEN-PLC.menu.upload_method.ethMethod.upload.options=
OPEN-PLC.menu.upload_method.ethMethod.upload.tool=ethtransfer

OPEN-PLC.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
OPEN-PLC.menu.upload_method.swdMethod.upload.protocol=0
OPEN-PLC.menu.upload_method.swdMethod.upload.options=-g
OPEN-PLC.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

OPEN-PLC.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
OPEN-PLC.menu.upload_method.serialMethod.upload.protocol=1
OPEN-PLC.menu.upload_method.serialMethod.upload.options=COM6
OPEN-PLC.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

OPEN-PLC.menu.upload_method.stm32progdfuMethod=STM32CubeProgrammer (DFU)
OPEN-PLC.menu.upload_method.stm32progdfuMethod.upload.protocol=2
OPEN-PLC.menu.upload_method.stm32progdfuMethod.upload.options=-g
OPEN-PLC.menu.upload_method.stm32progdfuMethod.upload.tool=stm32CubeProg

# OPEN-PLC.menu.upload_method.ethMethod=Ethernet (TCP)
# OPEN-PLC.menu.upload_method.ethMethod.upload.protocol=0
# OPEN-PLC.menu.upload_method.ethMethod.upload.options=
# OPEN-PLC.menu.upload_method.ethMethod.upload.tool=

################################################################################